# Лабораторная 1 - pandas
Владимир Кирилкин ПИ18-2

In [45]:
import pandas as pd
data = pd.read_csv("test.csv")
data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

Ознакомиться с основными параметрами датасета, используя функции библиотеки pandas, включая следующие данные:

a. Количество точек данных (измерений) в наборе

In [15]:
len(data)

418

b. Количество полей данных (атрибутов)

In [19]:
len(data.columns)

11

c. Тип данных каждого поля, шкала каждого поля

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

d. Количество отсутствующих значений для каждого поля

In [13]:
data.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

e. Количество и названия константных и уникальных полей

In [26]:
for col in data:
    print(col, len(data[col].unique()), "from", len(data[col])-data[col].isna().sum())

PassengerId 418 from 418
Pclass 3 from 418
Name 418 from 418
Sex 2 from 418
Age 80 from 332
SibSp 7 from 418
Parch 8 from 418
Ticket 363 from 418
Fare 170 from 417
Cabin 77 from 91
Embarked 3 from 418

4. Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения

In [29]:
data.drop(columns=("PassengerId", "Name", "Cabin"))

KeyError: "[('PassengerId', 'Name', 'Cabin')] not found in axis"

5. Заменить возраст пассажиров на год рождения

In [46]:
data["Age"] = 2020-data["Age"]
data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,1985.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,1973.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,1958.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,1993.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,1998.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,1981.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,1981.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

6. Переименовать все названия колонок на русском языке

In [34]:
data = data.rename(columns={"Pclass": "Класс", "Sex": "Пол","Age":"","SibSp":"Братьев/сестер на борту","Parch":"Детей/родителей на борту","Fare":"Цена билета", "Cabin":"Кабина","Embarked":"Отправление"})

7. Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [48]:
for col in data:
    if data[col].dtype == "object":
        mode = data[col].mode()
        data[col] = data[col] if data[col] is not None else mode
    else:
        mean = data[col].mean()
        data[col] = data[col] if data[col] is not None else mean

8. Сохранить получившийся набор данных в формате CSV

In [38]:
data.to_csv("new_test.csv", encoding="cp1251", sep=";")

9. Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx

10. Считать файл .xlsx в новый DataFrame

In [40]:
pd.read_excel("new_test.xlsx")

,Unnamed: 0,PassengerId,Класс,Name,Пол,Unnamed: 5,Братьев/сестер на борту,Детей/родителей на борту,Ticket,Цена билета,Кабина,Отправление
0,0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,8292-07-01 00:00:00,NaN,Q
1,1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0,NaN,S
2,2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,6875-09-01 00:00:00,NaN,Q
3,3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,6625-08-01 00:00:00,NaN,S
4,4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,2875-12-01 00:00:00,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,2020-05-08 00:00:00,NaN,S
414,414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9,C105,C
415,415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,2025-07-01 00:00:00,NaN,S
416,416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,2020-05-08 00:00:00,NaN,S
417,417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C